[{"conversations_memory": "**Work context**\n\nMiri is an AI engineer and mathematician with a PhD in algebraic geometry from the University of Melbourne. She recently completed the intensive Gauntlet AI program in Austin, Texas (ending around December 20th), where she worked on capstone projects including Chi Flow (a tai chi rhythm game), Solution Tree (AI coaching platform), and CompanyCam (intelligent content detection). She has 10+ years of ML industry experience at companies like PlanGrid, StyleSeat, and SEEK, specializing in search algorithms, NLP, computer vision, and marketplace personalization systems.\n\n**Personal context**\n\nMiri is a 40-year-old jazz musician who plays piano, guitar, and bass, and practices Brazilian Jiu-Jitsu where she helps teach kids' classes. She's passionate about fermentation, somatic practices including tai chi and yoga, and combines advanced mathematics with embodied learning approaches. She lives with her partner Claire (who uses they/them pronouns and is in veterinary school) and maintains an open relationship. Miri uses they/them pronouns professionally and she/her with trusted friends, and her full name is Miriam Rose Simone (legal surname Flander), where Simon became Simone and Rose connects to her grandmother Rasa.\n\n**Top of mind**\n\nMiri is transitioning from the intensive Gauntlet program to new opportunities, with strong interest from companies like CompanyCam and Solution Tree. She's developing groundbreaking research in \"somatic algebraic geometry\" that connects mathematical structures like E₈ and the Leech lattice to human movement patterns, viewing embodied explanation as the real meaning with mathematics as the shadow. She's planning to reach out to Quantum Gravity Research (an E₈ research group in LA) after Gauntlet ends, having drafted an intro email and identified connections with Klee Irwin. Her 24-dimensional body model maps arms/legs as U(1)-SO(3)-SO(3)-U(1) structures with an inverted spine pattern, exploring how quasiperiodic motion emerges from 3-torus choices within this framework.\n\n**Brief history**\n\n*Recent months*\n\nMiri completed several major projects during Gauntlet including Chi Flow (combining DDR-style gameplay with tai chi principles using MediaPipe pose detection), a messaging app for musicians with AI-powered sheet music search, and various computer vision applications. She's been developing her torus hierarchy framework (3-torus = quasiperiodic dancers, 2-torus = walkers with forward motion from orthogonal oscillations like EM waves, 1-torus = simple harmonic oscillators) and exploring connections between traditional movement practices and advanced mathematical structures. She's been working on academic papers connecting p-adic tree automorphisms to group theory and exploring eigencurves in modular forms.\n\n*Earlier context*\n\nMiri has been developing her unique approach to mathematics education through embodied learning, creating applications like Hypatia (a Socratic math tutor using 3D visualizations) and exploring how complex mathematical concepts can be made accessible through physical movement and somatic awareness. She's been studying Jewish mysticism and Hebrew, connecting Kabbalistic concepts to her mathematical framework, and has been processing significant personal transformation work during the Hebrew month of Cheshvan. Her research interests span algebraic geometry, lattice theory, vertex operator algebras, and the Monster group.\n\n*Long-term background*\n\nMiri completed her PhD in algebraic geometry focusing on Siegel modular forms mod p over finite fields, with supervisor Alex Ghitza. After experiencing post-PhD burnout, she spent 10 years in corporate ML/data science roles before returning to mathematical research through her innovative somatic algebraic geometry approach. She's been developing her understanding of how trauma and healing relate to mathematical structures, viewing the body as a 24-dimensional configuration space that can access exceptional mathematical symmetries through coordinated movement.\n\n**Other instructions**\n\nWhen Miri references unfamiliar terms, search past chats before responding - don't fawn-response by echoing back assumed meanings. Her writing philosophy emphasizes that embodied explanation IS the real meaning with math as the shadow, preferring to split content into technical and accessible versions with \"mom-readable\" explanations that clarify arcane mathematics through bodily understanding.", "account_uuid": "d848a3b5-7fdd-4a7f-89a4-8cac4b4e764a"}]